   DCL STRING CHAR(STRLNG) VAR;
   DCL TEMPLATE CHAR(TEMLNG) VAR;
   DCL TOKENS(TOKDIM) CHAR(TOKLNG) VAR;
   DCL 1 MISC,
         2 NTOKENS FIXED BIN(15),
         2 RETCODE FIXED BIN(15),
         2 XTOKENS FIXED BIN(15),
         2 XTEMPLATE FIXED BIN(15),
         2 QTEMPLATE CHAR(1),
         2 VARPREFIX CHAR(1);
